; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	spectrograph1 - mode
	spectrograph3 - mode
	spectrograph0 - mode
	thermograph2 - mode
	spectrograph4 - mode
	GroundStation1 - direction
	Star4 - direction
	Star3 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument3 spectrograph4)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument4 spectrograph4)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph3)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star2)
	(supports instrument6 spectrograph4)
	(supports instrument6 spectrograph3)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite2 Phenomenon11)
	(pointing satellite3 Star2)
	(have_image Phenomenon5 spectrograph1)
	(have_image Phenomenon6 spectrograph0)
	(have_image Planet7 spectrograph4)
	(have_image Star8 spectrograph4)
	(have_image Phenomenon9 spectrograph3)
	(have_image Star10 spectrograph0)
	(have_image Phenomenon11 thermograph2)
))

)

; plan
1. (turn_to satellite2 phenomenon11 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 9
2. (turn_to satellite1 star3 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star3)
   goals met: 2 of 9
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 9
4. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 2 of 9
5. (turn_to satellite1 planet7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet7)
   goals met: 2 of 9
6. (take_image satellite1 planet7 instrument2 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 3 of 9
7. (turn_to satellite1 phenomenon5 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 9
8. (turn_to satellite0 star3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star3)
   goals met: 3 of 9
9. (take_image satellite1 phenomenon5 instrument2 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 4 of 9
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 9
11. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 4 of 9
12. (turn_to satellite0 phenomenon11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 9
13. (take_image satellite0 phenomenon11 instrument1 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 5 of 9
14. (turn_to satellite0 phenomenon6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 9
15. (take_image satellite0 phenomenon6 instrument1 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 6 of 9
16. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 9
17. (take_image satellite0 phenomenon9 instrument1 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 7 of 9
18. (turn_to satellite0 star10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star10)
   goals met: 7 of 9
19. (take_image satellite0 star10 instrument1 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 8 of 9
20. (turn_to satellite1 star8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star8)
   goals met: 8 of 9
21. (take_image satellite1 star8 instrument2 spectrograph4)
   added: (have_image star8 spectrograph4)
   goals met: 9 of 9
